In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [12]:
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.W # NOT RECOMMENDED

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [22]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [23]:
df['New'] = df['W'] + df['Y']

In [24]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [44]:
df.shape

(4, 4)

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [46]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [47]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [48]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [50]:
df.loc['B','Y']

-0.8480769834036315

In [51]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# PANDAS PRACTICE

In [52]:
import numpy as np
import pandas as pd

In [53]:
from numpy.random import randint

In [61]:
df1 = pd.DataFrame(randint(1,100,(5,4)),['A','B','C','D','E'],['W','X','Y','Z'])
np.random.seed(101)

In [63]:
df1

    W   X   Y   Z
A  59  93  12  11
B  95  36  29   4
C  84  85  48  15
D  70  61  70  52
E   7  89  72  69

In [64]:
df1['W']

A    59
B    95
C    84
D    70
E     7
Name: W, dtype: int32

In [65]:
df1['Z']

A    11
B     4
C    15
D    52
E    69
Name: Z, dtype: int32

In [66]:
df1[['Y','Z']]

    Y   Z
A  12  11
B  29   4
C  48  15
D  70  52
E  72  69

In [67]:
df1['Y+Z'] = df1['Y'] + df1['Z']

In [68]:
df1

    W   X   Y   Z  Y+Z
A  59  93  12  11   23
B  95  36  29   4   33
C  84  85  48  15   63
D  70  61  70  52  122
E   7  89  72  69  141

In [69]:
df.shape

(4, 4)

In [73]:
df1

    W   X   Y   Z  Y+Z
A  59  93  12  11   23
B  95  36  29   4   33
C  84  85  48  15   63
D  70  61  70  52  122
E   7  89  72  69  141

In [78]:
df1

    W   X   Y   Z  Y+Z
A  59  93  12  11   23
B  95  36  29   4   33
C  84  85  48  15   63
D  70  61  70  52  122
E   7  89  72  69  141

In [79]:
df1.drop('Y+Z',axis=1,inplace=True)

In [80]:
df1

    W   X   Y   Z
A  59  93  12  11
B  95  36  29   4
C  84  85  48  15
D  70  61  70  52
E   7  89  72  69

In [81]:
df1.shape

(5, 4)

In [82]:
df1.loc['A']

W    59
X    93
Y    12
Z    11
Name: A, dtype: int32

In [83]:
df1.loc['C']

W    84
X    85
Y    48
Z    15
Name: C, dtype: int32

In [85]:
df1

    W   X   Y   Z
A  59  93  12  11
B  95  36  29   4
C  84  85  48  15
D  70  61  70  52
E   7  89  72  69

In [86]:
df1.loc['A','Z']

11

In [87]:
df1.loc['D','X']

61

In [88]:
df1.iloc[3]

W    70
X    61
Y    70
Z    52
Name: D, dtype: int32

In [89]:
df1.loc[['A','B','C'],['W','X','Y']]

    W   X   Y
A  59  93  12
B  95  36  29
C  84  85  48

In [90]:
df1.loc[['D','E'],['X','Y','Z']]

    X   Y   Z
D  61  70  52
E  89  72  69

In [91]:
df1

    W   X   Y   Z
A  59  93  12  11
B  95  36  29   4
C  84  85  48  15
D  70  61  70  52
E   7  89  72  69

In [92]:
df1.sum(axis=1)

A    175
B    164
C    232
D    253
E    237
dtype: int64